Repository: mkalwajih/Muhasebpro1
Catalog: lib/l10n/*/inventory/control.arb
Languages: ar

# title
source: Inventory Control
ar: مراقبة المخزون

source: Stocktaking
ar: الجرد

# startSession
source: Start Stocktaking
ar: بدء الجرد

source: Reservations
ar: الحجوزات

# reports
source: Inventory Reports
ar: تقارير المخزون

# balances
source: Stock Balances
ar: أرصدة المخزون

# valuation
source: Stock Valuation
ar: تقييم المخزون

# movement
source: Item Movement
ar: حركة الأصناف

source: Stocktaking Sessions
ar: جلسات الجرد

# manageStocktaking
source: Manage stocktaking sessions
ar: إدارة جلسات الجرد

# stocktakingInfo
source: View and manage stocktaking sessions
ar: عرض وإدارة جلسات الجرد

source: Stock Reservations
ar: حجوزات المخزون

# manageReservations
source: Manage stock reservations
ar: إدارة حجوزات المخزون

source: Create Reservation
ar: إنشاء حجز

# reservationInfo
source: Create and manage item reservations
ar: إنشاء وإدارة حجوزات الأصناف
