Repository: mkalwajih/Muhasebpro1
Catalog: lib/l10n/*/inventory/master.arb
Languages: ar

# title
source: Items
ar: الأصناف

# setup
source: Inventory Setup
ar: إعدادات المخزون

source: Item Groups
ar: مجموعات الأصناف

source: Warehouses
ar: المستودعات

# add
source: Add Item
ar: إضافة صنف

# code
source: Item Code
ar: كود الصنف

source: Barcode
ar: باركود

# type
source: Item Type
ar: نوع الصنف

source: Cost Price
ar: سعر التكلفة

source: Base Unit
ar: الوحدة الأساسية

# costingMethod
source: Default Costing Method
ar: طريقة التكلفة الافتراضية
