Repository: mkalwajih/Muhasebpro1
Catalog: lib/l10n/*/inventory/ops.arb
Languages: ar

# title
source: Stock Operations
ar: عمليات المخزون

# incoming
source: Incoming Stock
ar: الوارد

# outgoing
source: Outgoing Stock
ar: الصادر

source: Transfer
ar: تحويل

# opening
source: Opening Stock
ar: رصيد افتتاحي

source: Quantity
ar: الكمية

source: Unit Cost
ar: سعر الوحدة

source: Total Cost
ar: إجمالي التكلفة

# manageIncomingStock
source: Manage incoming stock orders
ar: إدارة الوارد

# manageOutgoingStock
source: Manage outgoing stock orders
ar: إدارة الصادر

source: Add Opening Stock
ar: إضافة رصيد افتتاحي

source: Manage warehouse transfers
ar: إدارة تحويلات المستودعات

source: Create Incoming Order
ar: إنشاء أمر توريد

source: Create Outgoing Order
ar: إنشاء أمر صرف

source: Create Transfer
ar: إنشاء تحويل

source: Incoming Stock Orders
ar: أوامر التوريد

source: Outgoing Stock Orders
ar: أوامر الصرف

source: Warehouse Transfers
ar: تحويلات المستودعات

source: Transfers
ar: التحويلات
