Repository: mkalwajih/Muhasebpro1
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Branch
ar: الفرع

source: Company
ar: الشركة

# warehouseTooltip
source: Will be enabled when Inventory module is active
ar: سيتم تفعيله عند تفعيل وحدة المخزون

source: Leave blank to keep unchanged
ar: اتركه فارغاً لعدم التغيير

# passwordLengthError
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# passwordNumberError
source: Password must contain a number
ar: يجب أن تحتوي كلمة المرور على رقم

source: Branch Groups
ar: مجموعات الفروع

source: Add New Branch Group
ar: إضافة مجموعة فروع جديدة

source: Edit Branch Group
ar: تعديل مجموعة الفروع

source: Are you sure you want to delete?
ar: هل أنت متأكد أنك تريد الحذف؟

source: Activate
ar: تفعيل

source: Upload Logo
ar: تحميل الشعار

source: Main Company
ar: الشركة الرئيسية

source: Yes
ar: نعم

source: No
ar: لا

source: No Denominations
ar: لا توجد فئات

source: View Company Info
ar: عرض معلومات الشركة

source: View Branches
ar: عرض الفروع

# viewCOA
source: View Chart of Accounts
ar: عرض دليل الحسابات

source: View Geographical Data
ar: عرض البيانات الجغرافية

source: View General Parameters
ar: عرض الإعدادات العامة

source: View Currencies
ar: عرض العملات

source: View Tax Settings
ar: عرض إعدادات الضرائب

source: System Setup
ar: إعدادات النظام

source: General Ledger
ar: دفتر الأستاذ العام

source: Inventory
ar: المخزون

source: Vendors
ar: الموردون

source: Customers
ar: العملاء

source: Reports
ar: التقارير

source: Welcome
ar: أهلاً بك

source: Logout
ar: تسجيل الخروج

source: Required Field
ar: حقل إجباري

# saveSuccess
source: Save Successful
ar: تم الحفظ بنجاح

source: Save Failed
ar: فشل الحفظ

# deactivateBranchConfirmationTitle
source: Deactivate Branch
ar: إلغاء تنشيط الفرع

# deactivateBranchConfirmationMessage
source: Are you sure you want to deactivate this branch?
ar: هل أنت متأكد أنك تريد إلغاء تنشيط هذا الفرع؟

source: Deactivate
ar: إلغاء التنشيط

source: Error
ar: خطأ

source: Chart of Accounts
ar: دليل الحسابات

source: Add New Account
ar: إضافة حساب جديد

source: Edit Account
ar: تعديل حساب

source: Company Code
ar: رمز الشركة

# companyNameAr
source: Company Name (Arabic)
ar: اسم الشركة (عربي)

# companyNameEn
source: Company Name (English)
ar: اسم الشركة (إنجليزي)

source: Country
ar: الدولة

source: Tax Number
ar: الرقم الضريبي

# commercialRegNo
source: Commercial Registration No.
ar: رقم السجل التجاري

source: Address
ar: العنوان

source: Phone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

source: Remarks
ar: ملاحظات

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Currencies
ar: العملات

source: Add New Currency
ar: إضافة عملة جديدة

source: Edit Currency
ar: تعديل عملة

# selectCurrencyPrompt
source: Select a currency to view details
ar: حدد عملة لعرض التفاصيل

source: Add New Denomination
ar: إضافة فئة جديدة

source: Edit Denomination
ar: تعديل فئة

source: Value
ar: القيمة

source: Type
ar: النوع

source: General Parameters
ar: الإعدادات العامة

source: Reset to Defaults
ar: إعادة تعيين الافتراضيات

source: Confirm Reset
ar: تأكيد إعادة التعيين

# confirmResetMessage
source: Are you sure you want to reset all general parameters to their default values?
ar: هل أنت متأكد أنك تريد إعادة تعيين جميع الإعدادات العامة إلى قيمها الافتراضية؟

source: Reset
ar: إعادة تعيين

source: General
ar: عام

source: Accounting
ar: محاسبة

source: Security
ar: الأمان

source: UI
ar: الواجهة

source: Backup
ar: النسخ الاحتياطي

# cannotChangeAccountSettings
source: Cannot change account settings while transactions exist
ar: لا يمكن تغيير إعدادات الحسابات أثناء وجود المعاملات

source: Geographical Data
ar: البيانات الجغرافية

source: Zones
ar: المناطق

source: Countries
ar: الدول

source: Governorates
ar: المحافظات

source: Cities
ar: المدن

source: Regions
ar: الأحياء

# selectParentPrompt
source: Select a parent to add a new item
ar: حدد أصلاً لإضافة عنصر جديد

source: Add New
ar: إضافة جديد

source: Confirm Deletion
ar: تأكيد الحذف

# confirmDeleteMessage
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

source: Delete
ar: حذف

source: Delete failed
ar: فشل الحذف

source: Add New Zone
ar: إضافة منطقة جديدة

source: Edit Zone
ar: تعديل منطقة

source: Add New Country
ar: إضافة دولة جديدة

source: Edit Country
ar: تعديل دولة

source: Add New Governorate
ar: إضافة محافظة جديدة

source: Edit Governorate
ar: تعديل محافظة

source: Add New City
ar: إضافة مدينة جديدة

source: Edit City
ar: تعديل مدينة

source: Add New Region
ar: إضافة حي جديد

source: Edit Region
ar: تعديل حي

source: Code
ar: الرمز

# nationalityAr
source: Nationality (Arabic)
ar: الجنسية (عربي)

# nationalityEn
source: Nationality (English)
ar: الجنسية (إنجليزي)

source: Active
ar: نشط

source: Role Management
ar: إدارة الأدوار

source: Add New Role
ar: إضافة دور جديد

source: Edit Role
ar: تعديل دور

source: Tax Settings
ar: إعدادات الضرائب

source: Tax Brackets
ar: شرائح الضرائب

source: Tax Types
ar: أنواع الضرائب

source: Tax Calculation Methods
ar: طرق حساب الضرائب

source: User Management
ar: إدارة المستخدمين

# userIsActive
source: Active
ar: نشط

# userIsInactive
source: Inactive
ar: غير نشط

source: Add New User
ar: إضافة مستخدم جديد

source: Edit User
ar: تعديل مستخدم

source: Account Number Type
ar: نوع رقم الحساب

source: Account Number Length
ar: طول رقم الحساب

source: Cost Center Policy
ar: سياسة مركز التكلفة

source: Project Policy
ar: سياسة المشروع

source: No Parent
ar: لا يوجد أصل

source: Parent Account
ar: الحساب الأصل

source: Report Type
ar: نوع التقرير

source: Detail Account Type
ar: نوع الحساب التفصيلي

source: Cash Flow Type
ar: نوع التدفق النقدي

source: Add New Branch
ar: إضافة فرع جديد

source: Edit Branch
ar: تعديل فرع

source: Branch Code
ar: رمز الفرع

# branchNameEn
source: Branch Name (English)
ar: اسم الفرع (إنجليزي)

# branchNameAr
source: Branch Name (Arabic)
ar: اسم الفرع (عربي)

source: Branch Group
ar: مجموعة الفرع

source: Default Warehouse
ar: المستودع الافتراضي

source: Logo
ar: الشعار

source: Currency Code
ar: رمز العملة

# fractionNameEn
source: Fraction Name (English)
ar: اسم الكسر (إنجليزي)

# fractionNameAr
source: Fraction Name (Arabic)
ar: اسم الكسر (عربي)

source: Exchange Rate
ar: سعر الصرف

source: Decimal Places
ar: الخانات العشرية

source: Base Currency
ar: العملة الأساسية

source: Denominations
ar: الفئات

source: Actions
ar: الإجراءات

source: Language
ar: اللغة

source: Date Format
ar: تنسيق التاريخ

source: Calendar Type
ar: نوع التقويم

# passwordMinLength
source: Password Minimum Length
ar: الحد الأدنى لطول كلمة المرور

source: Auto Lock Timeout
ar: مهلة القفل التلقائي

source: in minutes
ar: بالدقائق

source: Use VAT
ar: استخدام ضريبة القيمة المضافة

source: Use TDS
ar: استخدام ضريبة الخصم

source: Use E-Invoice
ar: استخدام الفاتورة الإلكترونية

source: Price Includes Tax
ar: السعر يشمل الضريبة

source: Add New Tax Bracket
ar: إضافة شريحة ضريبية جديدة

source: Tax Rate
ar: معدل الضريبة

source: Is Default
ar: افتراضي

source: Add New Tax Calculation Method
ar: إضافة طريقة حساب ضريبة جديدة

source: Category
ar: الفئة

source: Add New Tax Type
ar: إضافة نوع ضريبة جديد

source: Calculation Method
ar: طريقة الحساب

source: Sales Account
ar: حساب المبيعات

source: Purchases Account
ar: حساب المشتريات

source: UI Theme
ar: سمة الواجهة

source: Dark
ar: داكن

source: Light
ar: فاتح

source: Font Size
ar: حجم الخط

source: Username
ar: اسم المستخدم

# usernameRequired
source: Username is required
ar: اسم المستخدم مطلوب

# fullNameEn
source: Full Name (English)
ar: الاسم الكامل (إنجليزي)

# fullNameAr
source: Full Name (Arabic)
ar: الاسم الكامل (عربي)

source: Password
ar: كلمة المرور

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Confirm Password
ar: تأكيد كلمة المرور

source: Status
ar: الحالة

# enableBiometric
source: Enable Biometric Authentication
ar: تمكين المصادقة البيومترية

source: Link to Device
ar: ربط بالجهاز

source: Coming Soon!
ar: قريبا!

# featureUnderDevelopment
source: This feature is currently under development. Please check back later.
ar: هذه الميزة قيد التطوير حاليًا. يرجى التحقق لاحقًا.

# branchGroupNameEn
source: Branch Group Name (English)
ar: اسم مجموعة الفرع (إنجليزي)

# branchGroupNameAr
source: Branch Group Name (Arabic)
ar: اسم مجموعة الفرع (عربي)

# branchesModule
source: Branches
ar: الفروع

source: Company Info
ar: معلومات الشركة

# nameEn
source: Name (English)
ar: الاسم (إنجليزي)

# nameAr
source: Name (Arabic)
ar: الاسم (عربي)

source: Account Code
ar: رمز الحساب

# accountNameAr
source: Account Name (Arabic)
ar: اسم الحساب (عربي)

# accountNameEn
source: Account Name (English)
ar: اسم الحساب (إنجليزي)

# roleNameEn
source: Role Name (English)
ar: اسم الدور (إنجليزي)

# roleNameAr
source: Role Name (Arabic)
ar: اسم الدور (عربي)

source: Description
ar: البيان

source: Backup Frequency
ar: تكرار النسخ الاحتياطي

source: Cloud Backup
ar: النسخ الاحتياطي السحابي

# cloudBackupHint
source: Hint: Cloud backup is important.
ar: ملاحظة: النسخ الاحتياطي السحابي مهم.

source: Edit Tax Bracket
ar: تعديل الشريحة الضريبية

source: Edit Tax Calculation Method
ar: تعديل طريقة حساب الضريبة

source: Edit Tax Type
ar: تعديل نوع الضريبة

source: Branches
ar: الفروع

source: Add New Company
ar: إضافة شركة جديدة

# noCompaniesYet
source: No companies created yet. Add your first company!
ar: لم يتم إنشاء شركات بعد. أضف شركتك الأولى!

# selectCompanyPrompt
source: Select a company from the list to view/edit its details.
ar: حدد شركة من القائمة لعرض/تعديل تفاصيلها.

# noBranchesYet
source: No branches created yet. Add your first branch!
ar: لم يتم إنشاء فروع بعد. أضف فرعك الأول!

# selectBranchPrompt
source: Select a branch from the list to view/edit its details.
ar: حدد فرعًا من القائمة لعرض/تعديل تفاصيله.

# branchStatusUpdated
source: Branch status updated successfully.
ar: تم تحديث حالة الفرع.

# branchDeletedSuccessfully
source: Branch {branchName} deleted successfully.
ar: تم حذف الفرع {branchName} بنجاح.

source: Not Provided
ar: غير متوفر

source: Inactive
ar: غير نشط

# financialPeriodsTitle
source: Financial Periods
ar: الفترات المالية

# noFinancialPeriodsYet
source: No financial periods created yet. Add or generate your first periods!
ar: لم يتم إنشاء فترات مالية بعد. أضف أو أنشئ فتراتك الأولى!

# addFinancialPeriodButton
source: Add Financial Period
ar: إضافة فترة مالية

# generateFinancialPeriodsButton
source: Generate Financial Periods
ar: إنشاء فترات مالية

source: Add Financial Period
ar: إضافة فترة مالية

source: Edit Financial Period
ar: تعديل فترة مالية

source: Period Name
ar: اسم الفترة

# periodNameRequired
source: Period name is required
ar: اسم الفترة مطلوب

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Is Locked
ar: مؤمن

source: Unlocked
ar: غير مؤمن

source: Generate Financial Periods
ar: إنشاء الفترات المالية

source: Start Year
ar: سنة البدء

# invalidYear
source: Please enter a valid year
ar: الرجاء إدخال سنة صالحة

# invalidNumberOfYears
source: Please enter a valid number of years
ar: الرجاء إدخال عدد صحيح من السنوات

source: Login
ar: تسجيل الدخول

# loginTitle
source: MuhasebPro
ar: محاسب برو

# loginSubtitle
source: Sign in to your account
ar: سجل الدخول إلى حسابك

# invalidCredentials
source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

# userInactive
source: This account is inactive
ar: هذا الحساب غير نشط

# loginSuccess
source: Login successful
ar: تم تسجيل الدخول بنجاح

source: Login failed
ar: فشل تسجيل الدخول

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Remember me
ar: تذكرني

# registrationSuccess
source: Registration successful
ar: تم التسجيل بنجاح

# fullNameArRequired
source: Full name in Arabic is required
ar: الاسم الكامل باللغة العربية مطلوب

# fullNameEnRequired
source: Full name in English is required
ar: الاسم الكامل باللغة الإنجليزية مطلوب

# alreadyHaveAccount
source: Already have an account? Login
ar: لديك حساب بالفعل؟ تسجيل الدخول

# passwordResetSuccess
source: Password reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح

source: Back to Login
ar: العودة إلى تسجيل الدخول

source: New Password
ar: كلمة المرور الجديدة

source: GL Setup
ar: إعداد الأستاذ العام

# glSetupConfiguration
source: General Ledger Setup & Configuration
ar: إعداد وتكوين الأستاذ العام

source: Document Types
ar: أنواع المستندات

source: Description Coding
ar: ترميز البيانات

# docTypeCode
source: Type Code
ar: رمز النوع

source: Name (Arabic)
ar: الاسم عربي

source: Name (English)
ar: الاسم إنجليزي

source: Sequence Method
ar: طريقة الترقيم

source: Sequence Behavior
ar: سلوك الترقيم

source: Specific
ar: خاص

source: Auto-Unchangeable
ar: تلقائي غير قابل للتغيير

source: Auto-Changeable
ar: تلقائي قابل للتغيير

source: Manual
ar: يدوي

# descCode
source: Description Code
ar: رمز البيان

source: Description (Arabic)
ar: البيان عربي

source: Description (English)
ar: البيان إنجليزي

source: Linked Account
ar: الحساب المرتبط

source: Add Document Type
ar: إضافة نوع مستند

source: Edit Document Type
ar: تعديل نوع مستند

source: Add Description Coding
ar: إضافة ترميز بيان

source: Edit Description Coding
ar: تعديل ترميز بيان

# documentTypeCodeRequired
source: Document type code is required
ar: رمز نوع المستند مطلوب

# documentTypeCodeTooLong
source: Document type code must not exceed 10 characters
ar: رمز نوع المستند يجب ألا يتجاوز 10 أحرف

# nameArabicRequired
source: Arabic name is required
ar: الاسم العربي مطلوب

# nameArabicTooLong
source: Arabic name must not exceed 50 characters
ar: الاسم العربي يجب ألا يتجاوز 50 حرف

# nameEnglishRequired
source: English name is required
ar: الاسم الإنجليزي مطلوب

# nameEnglishTooLong
source: English name must not exceed 50 characters
ar: الاسم الإنجليزي يجب ألا يتجاوز 50 حرف

# descriptionCodeRequired
source: Description code is required
ar: رمز البيان مطلوب

# descriptionCodeTooLong
source: Description code must not exceed 10 characters
ar: رمز البيان يجب ألا يتجاوز 10 أحرف

# descriptionArabicRequired
source: Arabic description is required
ar: البيان العربي مطلوب

# descriptionArabicTooLong
source: Arabic description must not exceed 250 characters
ar: البيان العربي يجب ألا يتجاوز 250 حرف

# descriptionEnglishRequired
source: English description is required
ar: البيان الإنجليزي مطلوب

# descriptionEnglishTooLong
source: English description must not exceed 250 characters
ar: البيان الإنجليزي يجب ألا يتجاوز 250 حرف

# documentTypeAlreadyExists
source: Document type with this code already exists
ar: نوع المستند بهذا الرمز موجود بالفعل

# descriptionCodingAlreadyExists
source: Description coding with this code already exists
ar: ترميز البيان بهذا الرمز موجود بالفعل

source: Document type not found
ar: نوع المستند غير موجود

source: Description coding not found
ar: ترميز البيان غير موجود

# cannotDeleteDocumentTypeInUse
source: Cannot delete document type as it is used in transactions
ar: لا يمكن حذف نوع المستند لأنه مستخدم في المعاملات

source: Document type created successfully
ar: تم إنشاء نوع المستند بنجاح

source: Document type updated successfully
ar: تم تحديث نوع المستند بنجاح

source: Document type deleted successfully
ar: تم حذف نوع المستند بنجاح

source: Description coding created successfully
ar: تم إنشاء ترميز البيان بنجاح

source: Description coding updated successfully
ar: تم تحديث ترميز البيان بنجاح

source: Description coding deleted successfully
ar: تم حذف ترميز البيان بنجاح

source: Failed to delete description coding
ar: فشل في حذف ترميز البيان

# noDocumentTypesYet
source: No document types created yet. Add your first document type!
ar: لم يتم إنشاء أنواع مستندات بعد. أضف نوع المستند الأول!

# noDescriptionCodingYet
source: No description coding created yet. Add your first description coding!
ar: لم يتم إنشاء ترميز بيانات بعد. أضف ترميز البيان الأول!

source: Search document types...
ar: البحث في أنواع المستندات...

source: Search description coding...
ar: البحث في ترميز البيانات...

source: Select Account
ar: اختر حساب

source: No account selected
ar: لم يتم اختيار حساب

source: Access Denied
ar: تم رفض الوصول. ليس لديك صلاحية لعرض هذه الصفحة.

source: Search accounts...
ar: البحث في الحسابات...

# noAccountsYet
source: No accounts created yet.
ar: لم يتم إنشاء حسابات بعد.

# noAccountsFound
source: No accounts found matching your search.
ar: لم يتم العثور على حسابات تطابق بحثك.

source: Level
ar: المستوى

source: Nature
ar: الطبيعة

source: Edit
ar: تعديل

source: Clear
ar: مسح

source: Journal Vouchers
ar: قيود اليومية

source: View List
ar: عرض القائمة

source: Search
ar: بحث

source: Filter
ar: تصفية

source: Voucher saved successfully
ar: تم حفظ القيد بنجاح

source: Search Query
ar: استعلام البحث

source: Enter search term
ar: أدخل مصطلح البحث

source: Filter Options
ar: خيارات التصفية

source: Apply
ar: تطبيق

source: All
ar: الكل

source: Draft
ar: مسودة

source: Posted
ar: مرحل

source: Reversed
ar: معكوس

source: Search vouchers...
ar: البحث في القيود...

source: No vouchers found
ar: لم يتم العثور على قيود

# createFirstVoucher
source: Create your first voucher!
ar: أنشئ قيدك الأول!

source: Confirm Post
ar: تأكيد الترحيل

# confirmPostVoucher
source: Are you sure you want to post voucher {voucherName}?
ar: هل أنت متأكد من ترحيل القيد {voucherName}؟

source: Post
ar: ترحيل

source: Voucher posted successfully
ar: تم ترحيل القيد بنجاح

source: Confirm Delete
ar: تأكيد الحذف

# confirmDeleteVoucher
source: Are you sure you want to delete voucher {voucherName}?
ar: هل أنت متأكد من حذف القيد {voucherName}؟

source: Voucher deleted successfully
ar: تم حذف القيد بنجاح

source: Debit
ar: مدين

source: Credit
ar: دائن

source: Reference
ar: المرجع

source: Reversing
ar: عكسي

source: Periodic
ar: دوري

source: Document Type
ar: نوع المستند

source: Date
ar: التاريخ

source: Reference Code
ar: الرقم المرجعي

# pleaseSelectDocumentType
source: Please select a document type
ar: يرجى اختيار نوع المستند

# pleaseSelectBranch
source: Please select a branch
ar: يرجى اختيار الفرع

# pleaseEnterDescription
source: Please enter a description
ar: يرجى إدخال البيان

source: Journal Entries
ar: قيود اليومية

source: Add Line
ar: إضافة سطر

# noEntriesAdded
source: No entries added yet
ar: لم يتم إضافة قيود بعد

# addFirstEntry
source: Add your first journal entry
ar: أضف قيدك الأول

source: Add Journal Entry
ar: إضافة قيد يومية

source: Add
ar: إضافة

source: Total Debit
ar: إجمالي المدين

source: Total Credit
ar: إجمالي الدائن

source: Difference
ar: الفرق

source: Payment Vouchers
ar: سندات الدفع

source: Search payment vouchers...
ar: البحث في سندات الدفع...

source: Payment From Account
ar: الدفع من حساب

# pleaseSelectPaymentAccount
source: Please select a payment account
ar: يرجى اختيار حساب الدفع

source: Payment Method
ar: طريقة الدفع

source: Cash
ar: نقدي

source: Check
ar: شيك

source: Bank Transfer
ar: تحويل بنكي

source: Credit Card
ar: بطاقة ائتمان

source: Other
ar: أخرى

source: Check Number
ar: رقم الشيك

source: Beneficiary
ar: المستفيد

source: Payment Lines
ar: بنود الدفع

# noPaymentLinesAdded
source: No payment lines added yet
ar: لم يتم إضافة بنود دفع بعد

# addFirstPaymentLine
source: Add your first payment line
ar: أضف بند الدفع الأول

source: Add Payment Line
ar: إضافة بند دفع

source: Total Amount
ar: المبلغ الإجمالي

source: Payment From
ar: الدفع من

source: line
ar: بند

source: lines
ar: بنود

source: Receipt Vouchers
ar: سندات القبض

source: Search receipt vouchers...
ar: البحث في سندات القبض...

source: Receipt To Account
ar: القبض إلى حساب

# pleaseSelectReceiptAccount
source: Please select a receipt account
ar: يرجى اختيار حساب القبض

source: Receipt Method
ar: طريقة القبض

source: Payer
ar: الدافع

source: Receipt Lines
ar: بنود القبض

# noReceiptLinesAdded
source: No receipt lines added yet
ar: لم يتم إضافة بنود قبض بعد

# addFirstReceiptLine
source: Add your first receipt line
ar: أضف بند القبض الأول

source: Add Receipt Line
ar: إضافة بند قبض

source: Receipt To
ar: القبض إلى
